[{"title":"Thoughtnotes 001","permalink":"https://www.kurtisojohnson.com/thought-notes-001.html","link":"https://www.kurtisojohnson.com/thought-notes-001.html","date":"2020-03-11T00:00:00+00:00","modified":"2020-03-11T12:42:32+00:00","author":{"name":"Kurtis Johnson","url":"https://k-o-j.co/","email":"kurtis@wearefuturegov.com"},"content":"<p class=\"note\">Week notes are still in vogue right? Or they might’ve peaked. So many come and go (this might be my fourth attempt), though either way one thing still stands; they’re cathartic.</p>\n\n<p>So I’m giving this a go: 3x3. Three things, every three weeks, across three categories: Work, Noticing &amp; Signals. Three is always the number of choice. A proper arbitrary workshop finger in the air number of choice.</p>\n\n<p>Here goes.</p>\n\n<h2 id=\"01-work\">01 Work…</h2>\n<p>Is lots of content, data and information at the moment. The holy trinity.</p>\n<ul>\n  <li>\n    <p>Rediscovering and affirming that the internet is mostly words and data. Which means digital services are mostly words and data. So when a service’s core proposition is information provision (see statutory), words and data are important.</p>\n  </li>\n  <li>\n    <p>Somebody smart once explained how data isn’t just the stuff in databases, it’s the flow of info over time. Unfortunately, the over time bit is what hampers local authorities. Information provision evolves by committee, cottage industries emerge and silos are reinforced.</p>\n  </li>\n  <li>\n    <p>Which is why doing the hard work to make stuff easy is so important. But it’s hard, because you have to undo all of that reinforcement. Start where you are, use what you have and do what you can. That’s a formula for putting one foot in front of the other and getting moving. Must try to stick to that.</p>\n  </li>\n</ul>\n\n<h2 id=\"02-signals\">02 Signals…</h2>\n<p>Of time, rhythms and the agency model</p>\n<ul>\n  <li>\n    <p>Change takes time. Delivering business change takes time. Designing for organisational culture change takes an awful lot of time. So what do you do within an hourly-billable agency model that is optimised for less time?</p>\n  </li>\n  <li>\n    <p>Maybe it’s <em>just</em> aesthetic change that we do. Surface level stuff. Stuff that brings inertia to an area, seeding the start of bigger, more meaningful change. A signal of intent. Less impactful than the hyperbole that you need for bid writing and case studies. Though infinitely more authentic, still valuable, and pragmatic?</p>\n  </li>\n  <li>\n    <p>What’s the pricing model here though? Is that where we’re fundamentally going wrong? The equation of needing more hours, for more impact, for more growth doesn’t feel sustainable. But what’s the alternative? On the search for some signals.</p>\n  </li>\n  <li>\n    <p>One signal, is that it reminds me a bit of the third sector. When I worked for a charity, there was always tension between restricted and unrestricted fundraising. Restricted was the easier sell; people like the assurance of money going to a known thing. Unrestricted was the better business move. You could divert funds to the corporate core, where operations are the ‘force-multiplier’ for supercharging the rest of the org. So you diversify your income through different fundraising mechanisms.</p>\n  </li>\n  <li>\n    <p>In an agency context, that might mean diversifying your client project work. Big ticket stuff, the cash cow clients, that feed the more gritty, less sexy, but infinitely more valuable change pieces around the edges. Then you tightly control the billable time on the former, and switch the clock off on the latter. I don’t know.</p>\n  </li>\n</ul>\n\n<h2 id=\"03-noticing\">03 Noticing…</h2>\n<p>That writing to know what you think makes more and more sense when you don’t really have time to think.</p>\n<ul>\n  <li>\n    <p>Writing might be the best way to offload some computational memory of sorts. Freeing up processing power. For better ideas. Or more. Perhaps both if we’re optimistic.</p>\n  </li>\n  <li>\n    <p>This might be because when your thoughts are out there on paper, staring back at you, they start to evolve into something else. Like you’ve given yourself a different perspective. Or a wider lens from which to view them. To make sense of patterns and spot new connections. Articulating new frames of reference.</p>\n  </li>\n  <li>\n    <p>If <del>working</del> writing in the open makes things better, and you’re only as good as your frames of reference. Then it feels like a win win.</p>\n  </li>\n</ul>","excerpt":"Week notes are still in vogue right? Or they might’ve peaked. So many come and go (this might be my fourth attempt), though either way one thing still stands; they’re cathartic.","languages":null,"categories":["thinking"],"tags":["notes"]},{"title":"Slow agile","permalink":"https://www.kurtisojohnson.com/slow-agile.html","link":"https://www.kurtisojohnson.com/slow-agile.html","date":"2020-02-09T00:00:00+00:00","modified":"2020-03-01T21:45:09+00:00","author":{"name":"Kurtis Johnson","url":"https://k-o-j.co/","email":"kurtis@wearefuturegov.com"},"content":"<p>It might sound like an oxymoron, but ‘slow agile’ is a term I’ve landed on when trying to explain a concept we’re faced with often at FutureGov.</p>\n\n<p>To design public services for the 21st century, we approach change through small-scale interventions, combining human-centred design with agile delivery. A trojan horse; to begin creating the conditions for impact at scale.</p>\n\n<p>However small we start, you can almost guarantee one of our first challenges will be in how we fit agile ways of working into the cadence of a <a href=\"https://blog.wearefuturegov.com/waterfall-vs-agile-vs-building-homes-60ddaab9a1fc\">traditionally structured organisation.</a></p>\n\n<h2 id=\"whats-the-problem-with-taking-agile-at-face-value\">What’s the problem with taking agile at face value?</h2>\n<p>Agile as a mindset, approach or methodology largely signals speed. The terminology would suggest this to anyone grappling with this new way of working. Sprints, velocity, delivery and even ‘stand up’ all come loaded with an implied sense of pace. Though if you look back at the origins of ‘agile’ in this context, and <a href=\"https://agilemanifesto.org/%0A\">pull apart the manifesto</a>, there isn’t one mention of speed at all.</p>\n\n<h2 id=\"rethinking-the-definition\">Rethinking the definition</h2>\n<p>If being agile shouldn’t only be about speed, then what do we mean when we harp on about it? To complicate things for a start, there are two definitions when you look up agile. The first is where our practice gets rooted often: ‘able to move quickly and easily’. The emphasis is on doing things at speed.</p>\n\n<p>The second is a much more compelling definition for what we’re trying to do in our quest for change: ‘able to think and understand quickly’. Thinking and understanding, before we move quickly. This is particularly important when we’re facing <a href=\"https://blog.wearefuturegov.com/complexity-vs-complication-ec57135031e2\">complicated challenges in meeting complex needs</a>.</p>\n\n<p>Teams within most traditional organisations decide quickly and implement slowly. So although these organisations appear to move slowly - they do so with a flurry of rapid decisions below the surface. A bit like the propellers beneath a cruise ship, frantically churning to shift the course of a huge vessel.</p>\n\n<p>In contrast, I’m starting to believe 21st-century teams need to decide slowly and implement quickly (HT <a href=\"https://medium.com/@simon_30495\">@Simon_30495</a> for the ah ha moment). <a href=\"http://thoughtsoncoding.com/author/wes-dyer\">Wes Dyer (engineer at Waymo)</a> articulates this brilliantly when he says “make it correct, make it clear, make it concise, make it fast. In that order”.</p>\n\n<h2 id=\"taking-a-more-considered-approach\">Taking a more considered approach</h2>\n<p>So how can we make sure that our approach to agile encourages this? Moving away from a focus on speed and time-boxed activity for process sake, and instead encouraging teams to slow down the stuff decided beneath the surface? Here are a few areas that I’ve found might help:</p>\n\n<ol>\n  <li>Ensure actions meet outcomes: to be more considered in our approach and reduce the rush to show progress by burning through a to-do list.</li>\n  <li>Ensure leaders have a shared understanding (and know how to engage with the process): to afford the team(s) the space to operate across silos in new ways, rather than hold the expectation to see the same things delivered at a faster pace with half the team at half the cost.</li>\n  <li>Make sure the cadence and cycles you implement are proportional to the aims, and are empathetic to the demands of the people you’re working with.</li>\n  <li>Focus effort on adding value slowly in small steps: create more sustainable shifts as these compound over time. Start small, think big.</li>\n</ol>\n\n<p>Let’s not forget that in trying to help an organisation change, we’re rewiring the connections to breakdown silos, and building networks to share and grow new capabilities. These things take time, and should be approached with empathy in a considered way.</p>\n\n<p class=\"note\">An agile approach can help signal this change. It’s a great forcing function when paired with user-centred design to create the conditions for sustainable change. Though sometimes we need to slow down before we speed up.</p>","excerpt":"It might sound like an oxymoron, but ‘slow agile’ is a term I’ve landed on when trying to explain a concept we’re faced with often at FutureGov.","languages":null,"categories":["delivery"],"tags":["notes"]}]